# Контрольные вопросы:
- Что такое git и чем он отличается от GitHub?
git -- система контроля версий (СКВ), отслеживает изменения, синхронизирует.
github -- бесплатная платформа, предоставляющая функционал удаленных репозиториев.

- Зачем использовать git и подобные ему системы в больших проектах?
Над большими проектами обычно работает группа разработчиков.

- Какие основные термины используются при работе с git?

- В каких случаях имеет смысл создавать различные ветки проекта?

- В чем отличия merge и rebase? В чем преимущества и недостатки последнего из них?

- В чем отличия централизованных СКВ от децентрализованных?
